Repository: brianapp17/brianapp
Catalog: lib/l10n/app_*.arb
Languages: es

source: Solve your test
es: Resuelve tu test

# selectCategory
source: Select a category
es: Selecciona una categoría

# selectGenre
source: Select a genre
es: Selecciona un género

source: Source Language
es: Idioma de origen

source: Target Language
es: Idioma de destino

source: Select Image
es: Seleccionar imagen

source: Take Photo
es: Tomar foto

source: No image selected
es: Ninguna imagen seleccionada

source: Send
es: Enviar

source: Text copied
es: Texto copiado

# brianResponse
source: Look what Brian answered me
es: Mira lo que me respondió Brian

source: Answers with Explanation
es: Respuestas con explicación

source: Open Answers
es: Respuestas abiertas

source: Quick Answers
es: Respuestas rápidas

source: Answers with Explanation for Children
es: Respuestas con explicación para niños

source: Mathematics
es: Matemáticas

source: Science
es: Ciencias

source: Theoretical Physics
es: Física teórica

source: Physics Exercise
es: Física ejercicio

source: Theoretical Chemistry
es: Química teórica

source: Chemistry Exercise
es: Química ejercicio

source: Language
es: Lenguaje

source: Social History
es: Historia social

source: Computer Science
es: Informática

source: English Grammar
es: Gramática Inglés

source: Multiple Choice A B C
es: Multiopción A B C

source: Concept-Meaning Union
es: Unión de Concepto-Significado

source: Short Answer
es: Respuesta corta

source: True/False Selection
es: Selección de Verdadero/Falso

source: Fill in the Blank
es: Completa el Espacio

source: Best Option Selection
es: Selección de Mejor Opción

source: Extract Main Ideas
es: Extraer ideas principales

source: Sort
es: Ordenar

source: Translate
es: Traducir

# mathPromptWithExplanation
source: Solve the following math problems and explain your reasoning:
es: Resuelve los siguientes problemas matemáticos y explica tu razonamiento:

# sciencePromptWithExplanation
source: Answer the following natural science questions and explain your answer:
es: Responde las siguientes preguntas de ciencias naturales y explica tu respuesta:

# theoreticalPhysicsPromptWithExplanation
source: Answer the following theoretical physics questions and explain your answer:
es: Responde las siguientes preguntas de física teórica y explica tu respuesta:

# physicsExercisePromptWithExplanation
source: Solve the following physics exercises and explain your procedure:
es: Resuelve los siguientes ejercicios de física y explica tu procedimiento:

# theoreticalChemistryPromptWithExplanation
source: Answer the following theoretical chemistry questions and explain your answer:
es: Responde las siguientes preguntas de química teórica y explica tu respuesta:

# chemistryExercisePromptWithExplanation
source: Solve the following chemistry exercises and explain your procedure:
es: Resuelve los siguientes ejercicios de química y explica tu procedimiento:

# languagePromptWithExplanation
source: Answer the following language questions and explain your answer:
es: Responde las siguientes preguntas de lenguaje y explica tu respuesta:

# socialHistoryPromptWithExplanation
source: Answer the following social history questions and explain your answer:
es: Responde las siguientes preguntas de historia social y explica tu respuesta:

# computerSciencePromptWithExplanation
source: Answer the following computer science questions and explain your answer:
es: Responde las siguientes preguntas de informática y explica tu respuesta:

# englishGrammarPromptWithExplanation
source: Answer the following English grammar questions and explain your answer:
es: Responde las siguientes preguntas de gramática en inglés y explica tu respuesta:

# mathPromptOpen
source: Answer the following open-ended math questions:
es: Responde las siguientes preguntas abiertas de matemáticas:

# sciencePromptOpen
source: Answer the following open-ended natural science questions:
es: Responde las siguientes preguntas abiertas de ciencias naturales:

# theoreticalPhysicsPromptOpen
source: Answer the following open-ended theoretical physics questions:
es: Responde las siguientes preguntas abiertas de física teórica:

# physicsExercisePromptOpen
source: Solve the following physics exercises and answer the questions:
es: Resuelve los siguientes ejercicios de física y responde las preguntas:

# theoreticalChemistryPromptOpen
source: Answer the following open-ended theoretical chemistry questions:
es: Responde las siguientes preguntas abiertas de química teórica:

# chemistryExercisePromptOpen
source: Solve the following chemistry exercises and answer the questions:
es: Resuelve los siguientes ejercicios de química y responde las preguntas:

# languagePromptOpen
source: Answer the following open-ended language questions:
es: Responde las siguientes preguntas abiertas de lenguaje:

# languageSummaryPrompt
source: Answer the following language and literature question with a brief summary of the topic:
es: Responde la siguiente pregunta de lengua y literatura con un breve resumen del tema:

# socialHistoryPromptOpen
source: Answer the following open-ended social history questions:
es: Responde las siguientes preguntas abiertas de historia social:

# socialSummaryPrompt
source: Answer the following social history question with a brief summary of the topic:
es: Responde la siguiente pregunta de historia social con un breve resumen del tema:

# computerSciencePromptOpen
source: Answer the following open-ended computer science questions:
es: Responde las siguientes preguntas abiertas de informática:

# englishGrammarPromptOpen
source: Answer the following open-ended English grammar questions:
es: Responde las siguientes preguntas abiertas de gramática en inglés:

# multipleChoiceABCPrompt
source: Quickly analyze the following questions and give me ONLY the correct letter with its respective question number without explanations:
es: Analiza rápido las siguientes preguntas y dame SOLO la literal correcta con su respectivo número de pregunta sin explicaciones:

# conceptMeaningUnionPrompt
source: Match the meaning with its respective correct option and give me the ordered answers:
es: Une el significado con su respectiva opción correcta y dame las respuestas ordenadas:

# shortAnswerPrompt
source: Give short answers to the following question:
es: Da respuestas cortas a la siguiente pregunta:

# trueFalseSelectionPrompt
source: Indicate whether the following statements are True or False:
es: Indica si las siguientes afirmaciónes son Verdaderas o Falsas:

# fillInTheBlankPrompt
source: Complete the following sentences with the correct word or phrase:
es: Completa las siguientes frases con la palabra o frase correcta:

# bestOptionSelectionPrompt
source: Give me the correct option for each of the following questions. If they have a number, use its correlative to give me the answers to the following questions:
es: Dame la opción correcta para cada una de las siguientes preguntas si tienen numero usa su correlativo para darme las respuestas de las siguientes preguntas:

# extractMainIdeasPrompt
source: Extract the main ideas from the following text in an orderly manner:
es: Extrae de forma ordenada las ideas principales del siguiente texto:

# sortPrompt
source: Order the following elements according to their correct sequence:
es: Ordena los siguientes elementos de acuerdo a su correcta secuencia:

# translatePrompt
source: Translate this image from {sourceLanguage} to {targetLanguage}, just TRANSLATE it:
es: Traduce esta imagen del {sourceLanguage} al {targetLanguage} solo TRADUCELO:

# mathPromptWithExplanationForChildren
source: Solve the following math problems and explain your reasoning in a simple way with examples FOR CHILDREN:
es: Resuelve los siguientes problemas matemáticos y explica tu razonamiento de manera sencilla con ejemplos PARA NIÑOS:

# sciencePromptWithExplanationForChildren
source: Answer the following natural science questions and explain your answer with examples FOR CHILDREN:
es: Responde las siguientes preguntas de ciencias naturales y explica tu respuesta con ejemplos PARA NIÑOS:

# theoreticalPhysicsPromptWithExplanationForChildren
source: Answer the following theoretical physics questions and explain your answer in a way that a child can understand with examples FOR CHILDREN:
es: Responde las siguientes preguntas de física teórica y explica tu respuesta de forma que un niño pueda entender con ejemplos PARA NIÑOS:

# physicsExercisePromptWithExplanationForChildren
source: Solve the following physics exercises and explain your procedure step by step for children with examples FOR CHILDREN:
es: Resuelve los siguientes ejercicios de física y explica tu procedimiento paso a paso para niños con ejemplos PARA NIÑOS:

# theoreticalChemistryPromptWithExplanationForChildren
source: Answer the following theoretical chemistry questions and explain your answer using examples FOR CHILDREN:
es: Responde las siguientes preguntas de química teórica y explica tu respuesta usando con ejemplos PARA NIÑOS:

# chemistryExercisePromptWithExplanationForChildren
source: Solve the following chemistry exercises and explain your procedure clearly or with examples FOR CHILDREN:
es: Resuelve los siguientes ejercicios de química y explica tu procedimiento con claridad o con ejemplos PARA NIÑOS:

# languagePromptWithExplanationForChildren
source: Answer the following language questions and explain your answer with simple examples for children:
es: Responde las siguientes preguntas de lenguaje y explica tu respuesta con ejemplos simples para niños:

# socialHistoryPromptWithExplanationForChildren
source: Answer the following social history questions and explain your answer with easy-to-understand examples for children:
es: Responde las siguientes preguntas de historia social y explica tu respuesta con ejemplos fáciles de entender para niños:

# computerSciencePromptWithExplanationForChildren
source: Answer the following computer science questions and explain your answer using simple examples for children:
es: Responde las siguientes preguntas de informática y explica tu respuesta usando ejemplos sencillos para niños:

# englishGrammarPromptWithExplanationForChildren
source: Answer the following English grammar questions and explain your answer with simple examples for children:
es: Responde las siguientes preguntas de gramática en inglés y explica tu respuesta con ejemplos simples para niños :

source: Please select an image
es: Por favor selecciona una imagen

# errorGeneratingText
source: Error: Could not generate text after several attempts.
es: Error: No se pudo generar el texto después de varios intentos.
